html/go/interface.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>接口和方法</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="moretypes.html"> UP </a>
 |
 <a accesskey="H" href="go.html"> HOME </a>
</div><div id="content">
<h1 class="title">接口和方法</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">方法</a>
<ul>
<li><a href="#sec-1-1">接收者为指针</a></li>
</ul>
</li>
<li><a href="#sec-2">接口</a>
<ul>
<li><a href="#sec-2-1">隐式接口</a></li>
<li><a href="#sec-2-2">常用接口</a>
<ul>
<li><a href="#sec-2-2-1">Stringers</a></li>
<li><a href="#sec-2-2-2">error</a></li>
<li><a href="#sec-2-2-3">Reader</a></li>
<li><a href="#sec-2-2-4">web服务器</a></li>
<li><a href="#sec-2-2-5">图片</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">方法</h2>
<div class="outline-text-2" id="text-1">
<p>
Go 没有类，然而仍然可以在结构体类型上定义方法
</p>

<p>
方法接收者 出现在 func 关键字和方法名之间的参数中
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">type</span> <span style="color: #98fb98;">Vertex</span> <span style="color: #00ffff;">struct</span> {
        X, Y float64
}

<span style="color: #ff4500;">// </span><span style="color: #ff4500;">(v *Vertex)&#20316;&#20026;&#26041;&#27861;&#25509;&#25910;&#32773;&#20986;&#29616;&#22312;func&#20851;&#38190;&#23383;&#21644;&#26041;&#27861;&#21517;&#20013;&#38388;</span>
<span style="color: #00ffff;">func</span> (v *<span style="color: #98fb98;">Vertex</span>) <span style="color: #87cefa;">Abs</span>() <span style="color: #98fb98;">float64</span> {
        <span style="color: #00ffff;">return</span> math.<span style="color: #87cefa;">Sqrt</span>(v.X*v.X + v.Y*v.Y)
}

<span style="color: #00ffff;">func</span> <span style="color: #87cefa;">main</span>() {
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">v&#26159;&#19968;&#20010;&#32467;&#26500;&#20307;Vertex&#30340;&#25351;&#38024;</span>
        v := &amp;<span style="color: #98fb98;">Vertex</span>{3, 4}
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">5</span>
        fmt.<span style="color: #87cefa;">Println</span>(v.<span style="color: #87cefa;">Abs</span>())
}
</pre>
</div>

<p>
可以对包中的任意类型定义任意方法，而不仅仅是针对结构体。但是不能对来自其他包的类型或基础类型定义方法
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#23450;&#20041;&#26032;&#30340;&#31867;&#22411;MyFloat</span>
<span style="color: #00ffff;">type</span> <span style="color: #98fb98;">MyFloat</span> <span style="color: #98fb98;">float64</span>

<span style="color: #ff4500;">//</span><span style="color: #ff4500;">Abs&#26041;&#27861;&#20316;&#29992;&#20110;MyFloat&#31867;&#22411;&#19978;</span>
<span style="color: #00ffff;">func</span> (f <span style="color: #98fb98;">MyFloat</span>) <span style="color: #87cefa;">Abs</span>() <span style="color: #98fb98;">float64</span> {
        <span style="color: #00ffff;">if</span> f &lt; 0 {
                <span style="color: #00ffff;">return</span> <span style="color: #87cefa;">float64</span>(-f)
        }
        <span style="color: #00ffff;">return</span> <span style="color: #87cefa;">float64</span>(f)
}

<span style="color: #00ffff;">func</span> <span style="color: #87cefa;">main</span>() {
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">-1.4142135623730951</span>
        f := <span style="color: #87cefa;">MyFloat</span>(-math.Sqrt2)
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">1.4142135623730951</span>
        fmt.<span style="color: #87cefa;">Println</span>(f.<span style="color: #87cefa;">Abs</span>())
}
</pre>
</div>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">接收者为指针</h3>
<div class="outline-text-3" id="text-1-1">
<p>
有两个原因需要使用指针接收者
</p>
<ol class="org-ol">
<li>避免在每个方法调用中拷贝值（如果值类型是大的结构体的话会更有效率）
</li>
<li>方法可以修改接收者指向的值！ 
</li>
</ol>

<p>
假如Scale方法接收者不是结构体指针，而是结构体本身，那调用完v.Scale(5)后，x和y的值仍然是3和4
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">type</span> <span style="color: #98fb98;">Vertex</span> <span style="color: #00ffff;">struct</span> {
        X, Y float64
}

<span style="color: #00ffff;">func</span> (v *<span style="color: #98fb98;">Vertex</span>) <span style="color: #87cefa;">Scale</span>(f <span style="color: #98fb98;">float64</span>) {
        v.X = v.X * f
        v.Y = v.Y * f
}

<span style="color: #00ffff;">func</span> (v *<span style="color: #98fb98;">Vertex</span>) <span style="color: #87cefa;">Abs</span>() <span style="color: #98fb98;">float64</span> {
        <span style="color: #00ffff;">return</span> math.<span style="color: #87cefa;">Sqrt</span>(v.X*v.X + v.Y*v.Y)
}

<span style="color: #00ffff;">func</span> <span style="color: #87cefa;">main</span>() {
        v := &amp;<span style="color: #98fb98;">Vertex</span>{3, 4}
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">Before scaling: &amp;{X:3 Y:4}, Abs: 5</span>
        fmt.<span style="color: #87cefa;">Printf</span>(<span style="color: #ffa07a;">"Before scaling: %+v, Abs: %v\n"</span>, v, v.<span style="color: #87cefa;">Abs</span>())
        v.<span style="color: #87cefa;">Scale</span>(5)
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">After scaling: &amp;{X:15 Y:20}, Abs: 25</span>
        fmt.<span style="color: #87cefa;">Printf</span>(<span style="color: #ffa07a;">"After scaling: %+v, Abs: %v\n"</span>, v, v.<span style="color: #87cefa;">Abs</span>())
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">接口</h2>
<div class="outline-text-2" id="text-2">
<p>
接口是定义一组方法定义的集合。接口类型的值可以存放实现这些方法的任何值
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">type</span> <span style="color: #98fb98;">Abser</span> <span style="color: #00ffff;">interface</span> {
        <span style="color: #87cefa;">Abs</span>() float64
}

<span style="color: #00ffff;">type</span> <span style="color: #98fb98;">MyFloat</span> <span style="color: #98fb98;">float64</span>

<span style="color: #00ffff;">func</span> (f <span style="color: #98fb98;">MyFloat</span>) <span style="color: #87cefa;">Abs</span>() <span style="color: #98fb98;">float64</span> {
        <span style="color: #00ffff;">if</span> f &lt; 0 {
                <span style="color: #00ffff;">return</span> <span style="color: #87cefa;">float64</span>(-f)
        }
        <span style="color: #00ffff;">return</span> <span style="color: #87cefa;">float64</span>(f)
}

<span style="color: #00ffff;">type</span> <span style="color: #98fb98;">Vertex</span> <span style="color: #00ffff;">struct</span> {
        X, Y float64
}

<span style="color: #00ffff;">func</span> (v *<span style="color: #98fb98;">Vertex</span>) <span style="color: #87cefa;">Abs</span>() <span style="color: #98fb98;">float64</span> {
        <span style="color: #00ffff;">return</span> math.<span style="color: #87cefa;">Sqrt</span>(v.X*v.X + v.Y*v.Y)
}

<span style="color: #00ffff;">func</span> <span style="color: #87cefa;">main</span>() {
        <span style="color: #00ffff;">var</span> a Abser
        f := <span style="color: #87cefa;">MyFloat</span>(-math.Sqrt2)
        a = f <span style="color: #ff4500;">// </span><span style="color: #ff4500;">a MyFloat &#23454;&#29616;&#20102; Abser</span>
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">1.4142135623730951</span>
        fmt.<span style="color: #87cefa;">Println</span>(f.<span style="color: #87cefa;">Abs</span>())

        v := <span style="color: #98fb98;">Vertex</span>{3, 4}
        <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#19979;&#38754;&#19968;&#34892;&#65292;v &#26159;&#19968;&#20010; Vertex&#65288;&#32780;&#19981;&#26159; *Vertex&#65289;</span>
        <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#25152;&#20197;&#27809;&#26377;&#23454;&#29616; Abser&#12290;</span>
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">a = v</span>
        a = &amp;v <span style="color: #ff4500;">// </span><span style="color: #ff4500;">a *Vertex &#23454;&#29616;&#20102; Abser</span>
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">5</span>
        fmt.<span style="color: #87cefa;">Println</span>(a.<span style="color: #87cefa;">Abs</span>())
}
</pre>
</div>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">隐式接口</h3>
<div class="outline-text-3" id="text-2-1">
<p>
类型通过实现方法来实现接口。 没有显式声明的必要，所以也就没有关键字implements。
</p>

<p>
隐式接口解藕了实现接口的包和定义接口的包：互不依赖。因此，也就无需在每一个实现上增加新的接口名称，这样也鼓励了明确的接口定义。 
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">type</span> <span style="color: #98fb98;">Reader</span> <span style="color: #00ffff;">interface</span> {
        <span style="color: #87cefa;">Read</span>(b []<span style="color: #98fb98;">byte</span>) (n int, err error)
}

<span style="color: #00ffff;">type</span> <span style="color: #98fb98;">Writer</span> <span style="color: #00ffff;">interface</span> {
        <span style="color: #87cefa;">Write</span>(b []<span style="color: #98fb98;">byte</span>) (n int, err error)
}

<span style="color: #00ffff;">type</span> <span style="color: #98fb98;">ReadWriter</span> <span style="color: #00ffff;">interface</span> {
        Reader
        Writer
}

<span style="color: #00ffff;">func</span> <span style="color: #87cefa;">main</span>() {
        <span style="color: #00ffff;">var</span> w Writer
        <span style="color: #ff4500;">// </span><span style="color: #ff4500;">os.Stdout &#23454;&#29616;&#20102; Writer</span>
        w = os.Stdout
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">hello, writer</span>
        fmt.<span style="color: #87cefa;">Fprintf</span>(w, <span style="color: #ffa07a;">"hello, writer\n"</span>)
}
</pre>
</div>
<p>
os.Stdout只需要实现Write(b []byte) (n int, err error)方法，不需要显示声明implements Writer
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">常用接口</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1">Stringers</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
一个普遍存在的接口是 fmt 包中定义的 Stringer, 类似于java的toString方法
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Stringer &#26159;&#19968;&#20010;&#21487;&#20197;&#29992;&#23383;&#31526;&#20018;&#25551;&#36848;&#33258;&#24049;&#30340;&#31867;&#22411;, `fmt`&#21253; &#65288;&#36824;&#26377;&#35768;&#22810;&#20854;&#20182;&#21253;&#65289;&#20351;&#29992;&#36825;&#20010;&#26469;&#36827;&#34892;&#36755;&#20986;</span>
<span style="color: #00ffff;">type</span> <span style="color: #98fb98;">Stringer</span> <span style="color: #00ffff;">interface</span> {
    <span style="color: #87cefa;">String</span>() string
}
</pre>
</div>


<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">type</span> <span style="color: #98fb98;">Person</span> <span style="color: #00ffff;">struct</span> {
        Name string
        Age  int
}

<span style="color: #00ffff;">func</span> (p <span style="color: #98fb98;">Person</span>) <span style="color: #87cefa;">String</span>() <span style="color: #98fb98;">string</span> {
        <span style="color: #00ffff;">return</span> fmt.<span style="color: #87cefa;">Sprintf</span>(<span style="color: #ffa07a;">"%v (%v years)"</span>, p.Name, p.Age)
}

<span style="color: #00ffff;">func</span> <span style="color: #87cefa;">main</span>() {
        a := <span style="color: #98fb98;">Person</span>{<span style="color: #ffa07a;">"Arthur Dent"</span>, 42}
        z := <span style="color: #98fb98;">Person</span>{<span style="color: #ffa07a;">"Zaphod Beeblebrox"</span>, 9001}
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">Arthur Dent (42 years) Zaphod Beeblebrox (9001 years)</span>
        fmt.<span style="color: #87cefa;">Println</span>(a, z)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2">error</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Go 程序使用 error 值来表示错误状态
</p>

<p>
error 类型是一个内建接口
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">type</span> <span style="color: #98fb98;">error</span> <span style="color: #00ffff;">interface</span> {
        <span style="color: #87cefa;">Error</span>() string
}
</pre>
</div>
<p>
通常函数会返回一个 error 值，调用的它的代码应当判断这个错误是否等于 nil， 来进行错误处理 
</p>
<div class="org-src-container">

<pre class="src src-go">i, err := strconv.<span style="color: #87cefa;">Atoi</span>(<span style="color: #ffa07a;">"42"</span>)
<span style="color: #00ffff;">if</span> err != <span style="color: #7fffd4;">nil</span> {
        fmt.<span style="color: #87cefa;">Printf</span>(<span style="color: #ffa07a;">"couldn't convert number: %v\n"</span>, err)
        <span style="color: #00ffff;">return</span>
}
fmt.<span style="color: #87cefa;">Println</span>(<span style="color: #ffa07a;">"Converted integer:"</span>, i)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">type</span> <span style="color: #98fb98;">MyError</span> <span style="color: #00ffff;">struct</span> {
        When time.Time
        What string
}

<span style="color: #00ffff;">func</span> (e *<span style="color: #98fb98;">MyError</span>) <span style="color: #87cefa;">Error</span>() <span style="color: #98fb98;">string</span> {
        <span style="color: #00ffff;">return</span> fmt.<span style="color: #87cefa;">Sprintf</span>(<span style="color: #ffa07a;">"at %v, %s"</span>,
                e.When, e.What)
}

<span style="color: #00ffff;">func</span> <span style="color: #87cefa;">run</span>() <span style="color: #98fb98;">error</span> {
        <span style="color: #00ffff;">return</span> &amp;<span style="color: #98fb98;">MyError</span>{
                time.<span style="color: #87cefa;">Now</span>(),
                <span style="color: #ffa07a;">"it didn't work"</span>,
        }
}

<span style="color: #00ffff;">func</span> <span style="color: #87cefa;">main</span>() {
        <span style="color: #00ffff;">if</span> err := <span style="color: #87cefa;">run</span>(); err != <span style="color: #7fffd4;">nil</span> {
                <span style="color: #ff4500;">//</span><span style="color: #ff4500;">at 2016-12-16 16:18:31.903104 +0800 CST, it didn't work</span>
                fmt.<span style="color: #87cefa;">Println</span>(err)
        }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3">Reader</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
io 包指定了 io.Reader 接口， 它表示从数据流结尾读取。Go 标准库包含了这个接口的许多实现， 包括文件、网络连接、压缩、加密等等。
</p>

<p>
io.Reader 接口有一个 Read 方法：
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff4500;">//</span><span style="color: #ff4500;">Read &#29992;&#25968;&#25454;&#22635;&#20805;&#25351;&#23450;&#30340;&#23383;&#33410; slice&#65292;&#24182;&#19988;&#36820;&#22238;&#22635;&#20805;&#30340;&#23383;&#33410;&#25968;&#21644;&#38169;&#35823;&#20449;&#24687;&#12290; &#22312;&#36935;&#21040;&#25968;&#25454;&#27969;&#32467;&#23614;&#26102;&#65292;&#36820;&#22238; io.EOF &#38169;&#35823;</span>
<span style="color: #00ffff;">func</span> (<span style="color: #98fb98;">T</span>) <span style="color: #87cefa;">Read</span>(b []<span style="color: #98fb98;">byte</span>) (n <span style="color: #98fb98;">int</span>, err <span style="color: #98fb98;">error</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#21019;&#24314;&#20102;&#19968;&#20010; strings.Reader&#65292; &#24182;&#19988;&#20197;&#27599;&#27425; 8 &#23383;&#33410;&#30340;&#36895;&#24230;&#35835;&#21462;&#23427;&#30340;&#36755;&#20986;</span>
r := strings.<span style="color: #87cefa;">NewReader</span>(<span style="color: #ffa07a;">"Hello, Reader!"</span>)
b := <span style="color: #b0c4de;">make</span>([]<span style="color: #98fb98;">byte</span>, 8)

<span style="color: #ff4500;">// </span><span style="color: #ff4500;">n = 8 err = &lt;nil&gt; b = [72 101 108 108 111 44 32 82]</span>
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">b[:n] = "Hello, R"</span>
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">n = 6 err = &lt;nil&gt; b = [101 97 100 101 114 33 32 82]</span>
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">b[:n] = "eader!"</span>
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">n = 0 err = EOF b = [101 97 100 101 114 33 32 82]</span>
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">b[:n] = ""</span>
<span style="color: #00ffff;">for</span> {
        n, err := r.<span style="color: #87cefa;">Read</span>(b)
        fmt.<span style="color: #87cefa;">Printf</span>(<span style="color: #ffa07a;">"n = %v err = %v b = %v\n"</span>, n, err, b)
        fmt.<span style="color: #87cefa;">Printf</span>(<span style="color: #ffa07a;">"b[:n] = %q\n"</span>, b[:n])
        <span style="color: #00ffff;">if</span> err == io.EOF {
                <span style="color: #00ffff;">break</span>
        }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-4" class="outline-4">
<h4 id="sec-2-2-4">web服务器</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
包 http 通过任何实现了 http.Handler 的值来响应 HTTP 请求
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">package</span> http

<span style="color: #00ffff;">type</span> <span style="color: #98fb98;">Handler</span> <span style="color: #00ffff;">interface</span> {
    <span style="color: #87cefa;">ServeHTTP</span>(w ResponseWriter, r *Request)
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">type</span> <span style="color: #98fb98;">Hello</span> <span style="color: #00ffff;">struct</span>{}

<span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#31867;&#22411; Hello &#23454;&#29616;&#20102; http.Handler, &#25910;&#21040;&#20219;&#20309;&#35831;&#27714;&#27599;&#27425;&#37117;&#36820;&#22238;'Hello!'&#23383;&#31526;&#20018;</span>
<span style="color: #00ffff;">func</span> (h <span style="color: #98fb98;">Hello</span>) <span style="color: #87cefa;">ServeHTTP</span>(
        w <span style="color: #98fb98;">http.ResponseWriter</span>,
        r *<span style="color: #98fb98;">http.Request</span>) {
        fmt.<span style="color: #87cefa;">Fprint</span>(w, <span style="color: #ffa07a;">"Hello!"</span>)
}

<span style="color: #00ffff;">func</span> <span style="color: #87cefa;">main</span>() {
        <span style="color: #00ffff;">var</span> h Hello
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#30417;&#21548;4000&#31471;&#21475;</span>
        err := http.<span style="color: #87cefa;">ListenAndServe</span>(<span style="color: #ffa07a;">"localhost:4000"</span>, h)
        <span style="color: #00ffff;">if</span> err != <span style="color: #7fffd4;">nil</span> {
                log.<span style="color: #87cefa;">Fatal</span>(err)
        }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-5" class="outline-4">
<h4 id="sec-2-2-5">图片</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
Package image 定义了 Image 接口
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">package</span> image

<span style="color: #00ffff;">type</span> <span style="color: #98fb98;">Image</span> <span style="color: #00ffff;">interface</span> {
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">color.Model , &#36890;&#24120;&#30452;&#25509;&#20351;&#29992;&#39044;&#23450;&#20041;&#30340;&#23454;&#29616; image.RGBAModel </span>
        <span style="color: #87cefa;">ColorModel</span>() color.Model
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">Bounds &#26041;&#27861;&#30340; Rectangle &#36820;&#22238;&#20540;&#23454;&#38469;&#19978;&#26159;&#19968;&#20010; image.Rectangle&#65292; &#20854;&#23450;&#20041;&#22312; image &#21253;&#20013;</span>
        <span style="color: #87cefa;">Bounds</span>() Rectangle
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">color.Color , &#36890;&#24120;&#30452;&#25509;&#20351;&#29992;&#39044;&#23450;&#20041;&#30340;&#23454;&#29616; image.RGBA</span>
        <span style="color: #87cefa;">At</span>(x, y int) color.Color
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-go">m := image.<span style="color: #87cefa;">NewRGBA</span>(image.<span style="color: #87cefa;">Rect</span>(0, 0, 100, 100))
<span style="color: #ff4500;">//</span><span style="color: #ff4500;">(0,0)-(100,100)</span>
fmt.<span style="color: #87cefa;">Println</span>(m.<span style="color: #87cefa;">Bounds</span>())
<span style="color: #ff4500;">//</span><span style="color: #ff4500;">0 0 0 0</span>
fmt.<span style="color: #87cefa;">Println</span>(m.<span style="color: #87cefa;">At</span>(0, 0).<span style="color: #87cefa;">RGBA</span>())
</pre>
</div>

<p>
<a href="concurr.html">Next：并发</a>
</p>

<p>
<a href="moretypes.html"> Previous：数据类型</a>
</p>

<p>
<a href="go.html">Home：目录</a>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

     <br/>
    <div class='ds-thread'></div>
<script>
var duoshuoQuery = {short_name:'klose911'};
(function() {
	 var dsThread = document.getElementsByClassName('ds-thread')[0];
         dsThread.setAttribute('data-thread-key', document.title);
         dsThread.setAttribute('data-title', document.title);
         dsThread.setAttribute('data-url', window.location.href);
	 var ds = document.createElement('script');
	 ds.type = 'text/javascript';ds.async = true;
	 ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
	 ds.charset = 'UTF-8';
	 (document.getElementsByTagName('head')[0] 
				       || document.getElementsByTagName('body')[0]).appendChild(ds);
				       })();
</script>
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
  ga('create', 'UA-90850421-1', 'auto');
  ga('send', 'pageview');
</script>
</div>
</body>
</html>
